app/presenters/user_presenter.rb

SELECT "users".* FROM "users" WHERE (name LIKE '%gian%')
---
    def initialize(params)
        @params = params
        @all_users = User.all