app/views/users/index.html.erb

SELECT "users".* FROM "users" WHERE (LENGHT(users.followers) <= 1)
---
<% end %>
<% @presenter.users.each do |user| %>