app/controllers/followers_controller.rb

SELECT 1 AS one FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followed_user_id" = $2 LIMIT $3  [["follower_id", 1], ["followed_user_id", 2], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followed_user_id", 2], ["created_at", "2023-01-22 23:09:26.742281"], ["updated_at", "2023-01-22 23:09:26.742281"]]
INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followed_user_id", 3], ["created_at", "2023-01-22 14:02:12.512576"], ["updated_at", "2023-01-22 14:02:12.512576"]]
---
    def follow
        @followed_user = params.require(:id_followed)
        if ! Follow.exists?(follower_id: @current_user[:id], followed_user_id: @followed_user)
            @follow_user = Follow.create!(follower_id: @current_user[:id], followed_user_id: @followed_user)
            if @follow_user.save

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followed_user_id" = $2 LIMIT $3  [["follower_id", 1], ["followed_user_id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followed_user_id" = $2 LIMIT $3  [["follower_id", 1], ["followed_user_id", 2], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 38]]
---
    def unfollow
        @followed_user = params.require(:id_followed)
        if Follow.exists?(follower_id: @current_user[:id], followed_user_id: @followed_user)
            @unfollowed_user = Follow.find_by!(follower_id: @current_user[:id], followed_user_id: @followed_user)
            @unfollowed_user.destroy!