app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) AS "count_all", "users"."id" AS "users_id" FROM "users" GROUP BY "users"."id"
SELECT COUNT(*) AS "count_all", "users"."id" AS "users_id" FROM "users" INNER JOIN "follows" ON "follows"."followed_user_id" = "users"."id" INNER JOIN "users" "followers_users" ON "followers_users"."id" = "follows"."follower_id" GROUP BY "users"."id"
SELECT COUNT(*) AS "count_all", "users"."id" AS "users_id" FROM "users" INNER JOIN "follows" ON "follows"."follower_id" = "users"."id" INNER JOIN "users" "followings_users" ON "followings_users"."id" = "follows"."followed_user_id" GROUP BY "users"."id"
---
    def index #ruta a /users
        @users = User.all
        @followornot = @current_user.followings
        @populars = @users.sort_by { |u| u.received_follows.size }.last(3)
        @follower_count = @users.joins(:followers).group(:id).count()
        @following_count =  @users.joins(:followings).group(:id).count()

INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "gian"], ["age", 45], ["created_at", "2023-01-26 23:37:16.772244"], ["updated_at", "2023-01-26 23:37:16.772244"]]
UPDATE "users" SET "age" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["age", 30], ["updated_at", "2023-01-20 16:10:55.356148"], ["id", 2]]
---
    def create #es un post del nuevo usuario
        @user = User.create(user_params)
        if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 9]]
---
    def destroy
        Follow.where(follower_id: @user[:id]).or(followed_user_id: @user[:id]).destroy_all