app/controllers/users_controller.rb

    def create #es un post del nuevo usuario
        @user = User.create(user_params)
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ricardo"], ["age", 15], ["created_at", "2023-01-20 15:57:58.472090"], ["updated_at", "2023-01-20 15:57:58.472090"]]

    def destroy
        Follow.where(follower_id: @user[:id]).or(followed_user_id: @user[:id]).destroy_all
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 9]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]